src/cf/Catalogs/узШаблоны.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>узШаблоны</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФайлШаблонаХранилищеЗначений</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьШаблонУказанныйВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/узШаблоны/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Заголовок = НСтр("ru = 'Укажите файл шаблона'");
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ОбработатьВыборФайлаДляШаблона",ЭтотОбъект);
	ДиалогВыбораФайла.Показать(Оповещение);

КонецПроцедуры

&НаКлиенте 
Процедура ОбработатьВыборФайлаДляШаблона(ВыбранныйКаталог, ДополнительныеПараметры) Экспорт 
	Если ВыбранныйКаталог = Неопределено Тогда
		Возврат;
	Конецесли;
	
	Объект.ИмяФайла = ВыбранныйКаталог[0];
	
	Объект.Расширение = ПолучитьРасширениеФайла(Объект.ИмяФайла);
	
	ИспользоватьШаблонУказанныйВручную = Ложь;
	Если ЗначениеЗаполнено(Объект.ИмяФайла)
		И ЗначениеЗаполнено(Объект.Расширение) Тогда
		ИспользоватьШаблонУказанныйВручную = Истина;		
	Конецесли;
	
	Объект.ИспользоватьШаблонУказанныйВручную = ИспользоватьШаблонУказанныйВручную;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьРасширениеФайла(ЗНАЧ ИмяФайла)
	РасширениеФайла = "";
	
	ПозТочки = СтрНайти(ИмяФайла,".",НаправлениеПоиска.СКонца);
	
	РасширениеФайла = Сред(ИмяФайла,ПозТочки);
	
	Возврат РасширениеФайла;
КонецФункции 

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ДвоичныеДанные = Новый ДвоичныеДанные(АдресНаСервере);
	//ДвоичныеДанные.ОткрытьПотокДляЧтения();
	ТекущийОбъект.ФайлШаблонаХранилищеЗначений = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9));	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	АдресФайла = "";
	пИмяФайла = Объект.ИмяФайла;

	Оповещение = Новый ОписаниеОповещения("ОбработатьПомещениеФайлаНаСервер",ЭтаФорма);
	
	НачатьПомещениеФайла(Оповещение,АдресФайла,пИмяФайла,Ложь, Новый УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПомещениеФайлаНаСервер(РезультаВыбора, Адрес, ВыбранноеИмяФайла,ДополнительныеПараметры) Экспорт
	Если РезультаВыбора = Неопределено Тогда
		Возврат;
	Конецесли;
	ИмяФайлаДляРасширения = Объект.Расширение;
	
	ДопПараметры = Новый Структура();
	ДопПараметры.Вставить("АдресФайла",Адрес);
	ДопПараметры.Вставить("ИмяФайлаДляРасширения",ИмяФайлаДляРасширения);
	
	КомандаПрочитатьФайлНаСервере(ДопПараметры);
КонецПроцедуры 

&НаСервере
Процедура КомандаПрочитатьФайлНаСервере(ДопПараметры)
	
	АдресФайла = ДопПараметры.АдресФайла;
	ИмяФайлаДляРасширения = ДопПараметры.ИмяФайлаДляРасширения;
									
	//Расширение = РасширениеФайла(ИмяФайлаДляРасширения);
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайла);
	АдресНаСервере = ПолучитьИмяВременногоФайла(ИмяФайлаДляРасширения);
	ДвоичныеДанные.Записать(АдресНаСервере);
	
КонецПроцедуры
